# import pandas as pd
import numpy as np

In [2]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]

In [3]:
BabyDataset = list(zip(names,births))

In [4]:
BabyDataset

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [9]:
df = pd.DataFrame(data = BabyDataset,columns = ['names','births'])

In [10]:
df

     names  births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [12]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
dates = pd.date_range("20130101", periods=6)

In [14]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [16]:
df

                   A         B         C         D
2013-01-01  0.017219 -0.995277 -0.044553  1.210950
2013-01-02 -0.400827  0.412861 -0.979898 -0.581361
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116
2013-01-04 -1.306214 -0.584835  1.093359 -1.768895
2013-01-05 -0.131352 -0.563617 -0.711082 -0.364940
2013-01-06  0.259568  1.767894  0.746827  0.504357

In [22]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4))),
        "D": np.array([3] * 4),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [23]:
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  1  3  train  foo
2  1.0 2013-01-02  1  3   test  foo
3  1.0 2013-01-02  1  3  train  foo

In [26]:
df.to_numpy()

array([[ 0.01721899, -0.99527682, -0.04455344,  1.21094952],
       [-0.40082726,  0.4128611 , -0.97989847, -0.58136094],
       [ 0.87362531, -0.47959605, -1.45027776, -0.55011621],
       [-1.30621374, -0.58483451,  1.09335877, -1.76889515],
       [-0.13135228, -0.56361704, -0.71108236, -0.36494033],
       [ 0.25956811,  1.76789436,  0.74682679,  0.50435705]])

In [27]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1, 3, 'train', 'foo']],
      dtype=object)

In [28]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.017219   -0.400827    0.873625   -1.306214   -0.131352    0.259568
B   -0.995277    0.412861   -0.479596   -0.584835   -0.563617    1.767894
C   -0.044553   -0.979898   -1.450278    1.093359   -0.711082    0.746827
D    1.210950   -0.581361   -0.550116   -1.768895   -0.364940    0.504357

In [29]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [30]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.210950 -0.044553 -0.995277  0.017219
2013-01-02 -0.581361 -0.979898  0.412861 -0.400827
2013-01-03 -0.550116 -1.450278 -0.479596  0.873625
2013-01-04 -1.768895  1.093359 -0.584835 -1.306214
2013-01-05 -0.364940 -0.711082 -0.563617 -0.131352
2013-01-06  0.504357  0.746827  1.767894  0.259568

In [31]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.259568  1.767894  0.746827  0.504357
2013-01-05 -0.131352 -0.563617 -0.711082 -0.364940
2013-01-04 -1.306214 -0.584835  1.093359 -1.768895
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116
2013-01-02 -0.400827  0.412861 -0.979898 -0.581361
2013-01-01  0.017219 -0.995277 -0.044553  1.210950

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.017219 -0.995277 -0.044553  1.210950
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116
2013-01-06  0.259568  1.767894  0.746827  0.504357

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.017219       NaN       NaN  1.210950
2013-01-02       NaN  0.412861       NaN       NaN
2013-01-03  0.873625       NaN       NaN       NaN
2013-01-04       NaN       NaN  1.093359       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.259568  1.767894  0.746827  0.504357

In [40]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130101", periods=6))

In [41]:
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [42]:
df["F"] = s1

In [43]:
df

                   A         B         C         D  F
2013-01-01  0.017219 -0.995277 -0.044553  1.210950  1
2013-01-02 -0.400827  0.412861 -0.979898 -0.581361  2
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116  3
2013-01-04 -1.306214 -0.584835  1.093359 -1.768895  4
2013-01-05 -0.131352 -0.563617 -0.711082 -0.364940  5
2013-01-06  0.259568  1.767894  0.746827  0.504357  6

In [44]:
df.at[dates[0], "A"] = 0

In [45]:
df

                   A         B         C         D  F
2013-01-01  0.000000 -0.995277 -0.044553  1.210950  1
2013-01-02 -0.400827  0.412861 -0.979898 -0.581361  2
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116  3
2013-01-04 -1.306214 -0.584835  1.093359 -1.768895  4
2013-01-05 -0.131352 -0.563617 -0.711082 -0.364940  5
2013-01-06  0.259568  1.767894  0.746827  0.504357  6

In [48]:
df.iat[0, 1] = 0

In [49]:
df

                   A         B         C         D  F
2013-01-01  0.000000  0.000000 -0.044553  1.210950  1
2013-01-02 -0.400827  0.412861 -0.979898 -0.581361  2
2013-01-03  0.873625 -0.479596 -1.450278 -0.550116  3
2013-01-04 -1.306214 -0.584835  1.093359 -1.768895  4
2013-01-05 -0.131352 -0.563617 -0.711082 -0.364940  5
2013-01-06  0.259568  1.767894  0.746827  0.504357  6

In [55]:
df.loc[:, "D"] = np.array([5] * len(df))

In [56]:
df.dtypes

A    float64
B    float64
C    float64
D      int32
F      int64
dtype: object

In [64]:
# if you want to add new index 
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0]:dates[2], "E"] = 1

In [65]:
df1

                   A         B         C  D  F    E
2013-01-01  0.000000  0.000000 -0.044553  5  1  1.0
2013-01-02 -0.400827  0.412861 -0.979898  5  2  1.0
2013-01-03  0.873625 -0.479596 -1.450278  5  3  1.0
2013-01-04 -1.306214 -0.584835  1.093359  5  4  NaN

In [15]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

In [16]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])

In [17]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [18]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [19]:
df

                     A         B
first second
bar   one     0.149790  0.454149
      two     0.638780  0.157317
baz   one    -0.324500 -0.645031
      two     1.265035 -1.288847
foo   one    -0.404663  0.352702
      two    -0.329654  0.798705
qux   one    -1.997122  0.342642
      two     0.030794  0.352311

In [78]:
ser = pd.Series([1, 2], dtype='int32')
ser

0    1
1    2
dtype: int32

In [79]:
ser.astype('category')

0    1
1    2
dtype: category
Categories (2, int64): [1, 2]

In [80]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)

In [81]:
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [82]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
             'Chrome']
df.reindex(new_index)

               http_status  response_time
Safari               404.0           0.07
Iceweasel              NaN            NaN
Comodo Dragon          NaN            NaN
IE10                 404.0           0.08
Chrome               200.0           0.02

In [83]:
df.reindex(new_index, fill_value=0)

               http_status  response_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [84]:
df.reindex(new_index, fill_value='missing')

              http_status response_time
Safari                404          0.07
Iceweasel         missing       missing
Comodo Dragon     missing       missing
IE10                  404          0.08
Chrome                200          0.02

In [85]:
df.reindex(['http_status', 'user_agent'], axis="columns")

           http_status  user_agent
Firefox            200         NaN
Chrome             200         NaN
Safari             404         NaN
IE10               404         NaN
Konqueror          301         NaN

In [86]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

In [87]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [88]:
df.reset_index()

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [89]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

In [29]:
index = pd.MultiIndex.from_tuples([('bird', 'falcon'),
                                   ('bird', 'parrot'),
                                   ('mammal', 'lion'),
                                   ('mammal', 'monkey')],
                                  names=['class', 'name'])
columns = pd.MultiIndex.from_tuples([('speed', 'max'),
                                     ('species', 'type')])
df = pd.DataFrame([(389.0, 'fly'),
                   ( 24.0, 'fly'),
                   ( 80.5, 'run'),
                   (np.nan, 'jump')],
                  index=index,
                  columns=columns)

In [30]:
df

               speed species
                 max    type
class  name
bird   falcon  389.0     fly
       parrot   24.0     fly
mammal lion     80.5     run
       monkey    NaN    jump

In [31]:
df.reset_index(level = 'class')

         class  speed species
                  max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [35]:
df.reset_index(level='class', col_level=1)

                speed species
         class    max    type
name
falcon    bird  389.0     fly
parrot    bird   24.0     fly
lion    mammal   80.5     run
monkey  mammal    NaN    jump

In [2]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [3]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [4]:
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [5]:
df.set_index(['year', 'month'])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [6]:
df.set_index([pd.Index([1, 2, 3, 4]), 'year'])

        month  sale
  year
1 2012      1    55
2 2014      4    40
3 2013      7    84
4 2014     10    31

In [7]:
s = pd.Series([1, 2, 3, 4])
df.set_index([s, s**2])

      month  year  sale
1 1       1  2012    55
2 4       4  2014    40
3 9       7  2013    84
4 16     10  2014    31

In [8]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})

In [9]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [10]:
df.set_axis(['a', 'b', 'c'], axis='index')

   A  B
a  1  4
b  2  5
c  3  6

In [11]:
df.set_axis(['I', 'II'], axis='columns')

   I  II
0  1   4
1  2   5
2  3   6

In [20]:
df_single_level_cols = pd.DataFrame([[0, 1], [2, 3]],
                                    index=['cat', 'dog'],
                                    columns=['weight', 'height'])

In [21]:
df_single_level_cols

     weight  height
cat       0       1
dog       2       3

In [22]:
df_single_level_cols.stack()

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

In [23]:
multicol1 = pd.MultiIndex.from_tuples([('weight', 'kg'),
                                       ('weight', 'pounds')])
df_multi_level_cols1 = pd.DataFrame([[1, 2], [2, 4]],
                                    index=['cat', 'dog'],
                                    columns=multicol1)

In [24]:
df_multi_level_cols1

    weight
        kg pounds
cat      1      2
dog      2      4

In [25]:
df_multi_level_cols1.stack()

            weight
cat kg           1
    pounds       2
dog kg           2
    pounds       4

In [27]:
df_multi_level_cols3 = pd.DataFrame([[None, 1.0], [2.0, 3.0]],
                                    index=['cat', 'dog'],
                                    columns=multicol1)

In [28]:
df_multi_level_cols3

    weight
        kg pounds
cat    NaN    1.0
dog    2.0    3.0

In [4]:
s = pd.Series(["dog", "cat", "monkey"])

In [5]:
s

0       dog
1       cat
2    monkey
dtype: object

In [6]:
s.rename_axis("animal")

animal
0       dog
1       cat
2    monkey
dtype: object

In [8]:
df = pd.DataFrame({"num_legs": [4, 4, 2],
                   "num_arms": [0, 0, 2]},
                  ["dog", "cat", "monkey"])

In [9]:
df

        num_legs  num_arms
dog            4         0
cat            4         0
monkey         2         2

In [10]:
df.rename_axis("animal")

        num_legs  num_arms
animal
dog            4         0
cat            4         0
monkey         2         2

In [15]:
df = df.rename_axis("limbs", axis= 'columns')

In [16]:
df

limbs   num_legs  num_arms
dog            4         0
cat            4         0
monkey         2         2

In [17]:
df.index = pd.MultiIndex.from_product([['mammal'],
                                       ['dog', 'cat', 'monkey']],
                                      names=['type', 'name'])

In [18]:
df.index

MultiIndex([('mammal',    'dog'),
            ('mammal',    'cat'),
            ('mammal', 'monkey')],
           names=['type', 'name'])

In [19]:
df.rename_axis(index={'type': 'class'})

limbs          num_legs  num_arms
class  name
mammal dog            4         0
       cat            4         0
       monkey         2         2

In [20]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [21]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [22]:
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [23]:
df.set_index(['year', 'month'])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [3]:
# adding a suffix
df = pd.DataFrame({'A': [1, 2, 3, 4], 'B': [3, 4, 5, 6]})

In [4]:
df.add_prefix('col_')

   col_A  col_B
0      1      3
1      2      4
2      3      5
3      4      6

In [5]:
# pivot_table
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [6]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [7]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum)

In [8]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [9]:
# dataframe join
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
                   'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

In [11]:
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                      'B': ['B0', 'B1', 'B2']})

In [12]:
df.join(other, lsuffix='_caller', rsuffix='_other')

  key_caller   A key_other    B
0         K0  A0        K0   B0
1         K1  A1        K1   B1
2         K2  A2        K2   B2
3         K3  A3       NaN  NaN
4         K4  A4       NaN  NaN
5         K5  A5       NaN  NaN